# IsLessThanOrAlmostEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MathComparisonUtils..::..IsLessThanOrAlmostEqual Method
MathComparisonUtils Class See Also
---
Checks if value1 is less than or almost equal to value2, using the internal tolerance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static bool IsLessThanOrAlmostEqual(
	double value1,
	double value2
)
```

Visual Basic
---
```text
Public Shared Function IsLessThanOrAlmostEqual ( _
	value1 As Double, _
	value2 As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsLessThanOrAlmostEqual(
	double value1,
	double value2
)
```

# ### Parameters
value1
    Type: System..::..Double The first value.
value2
    Type: System..::..Double The second value.
# ### Return Value
True if value1 is less than or almost equal to value2, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value for value1 is not finite -or- The given value for value2 is not finite |

# See Also
MathComparisonUtils Class
Autodesk.Revit.DB Namespace